inst/doc/binomial-case-control-ascertainment.org
* Ascertaiment Sampling 

Selecting the ascertained pairs 

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
library(mets)
data(twinstut)
twinstut$binstut <- 1*(twinstut$stutter=="yes")
twinstut <- subset(twinstut,zyg%in%c("mz","dz"))
dnumeric(twinstut) <- ~.
dfactor(twinstut,labels=c("DZ","MZ")) <- binzyg~zyg.n
ddrop(twinstut) <- ~"*.n"

twinstut  <-   dby(twinstut,binstut~tvparnr,stuttot=sum,nn=seq_along,n=length)
twina     <-   subset(twinstut,n==2 & stuttot>=1)
#+END_SRC  

#+RESULTS:


Selecting on the pairs where there is stuttering at taking a look at the 
tables of discordance and concordance for the twins. 


#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
twinda <- fast.reshape(twina,id="tvparnr")
twind <- fast.reshape(twinstut,id="tvparnr")
dtable(twind,"binst*"~I(stuttot1>=1))
dtable(twinda,~"binst*")
#+END_SRC  

#+RESULTS:
#+begin_example
I(stuttot1 >= 1): FALSE

         binstut2    0
binstut1              
0                 6632
------------------------------------------------------------ 
I(stuttot1 >= 1): TRUE

         binstut2   0   1
binstut1                 
0                   0 289
1                 281 111

         binstut2   0   1
binstut1                 
0                   0 289
1                 281 111
#+end_example


Now doing the analyses 

** Biprobit model 

Looking at the full data for comparison. We estimate an unstructured
probit model with different correlations for MZ and DZ twins. 

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
b1 <- biprobit(binstut~sex,~-1+binzyg,data=twinstut,id="tvparnr")
summary(b1)
#+END_SRC  

#+RESULTS:
#+begin_example

              Estimate    Std.Err          Z p-value
(Intercept)  -1.794821   0.023289 -77.066826  0.0000
sexmale       0.401430   0.030179  13.301756  0.0000
r:binzygDZ    0.132458   0.062516   2.118802  0.0341
r:binzygMZ    1.096915   0.073574  14.909085  0.0000

logLik: -4400.536  mean(score^2): 1.022e-06 
    n pairs 
21288  7313 

Contrast:
	Dependence    [binzygDZ] 
	Mean          [(Intercept)] 

                        Estimate 2.5%    97.5%  
Rel.Recur.Risk          1.77662  0.92746 2.62577
OR                      1.88752  1.09432 3.25566
Tetrachoric correlation 0.13169  0.00993 0.24960
                                                
Concordance             0.00235  0.00140 0.00393
Casewise Concordance    0.06456  0.03937 0.10413
Marginal                0.03634  0.03287 0.04016
#+end_example




A similar analysis of the ascertained data reveals (some problems) ...

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
ba1 <- biprobit(binstut~sex,~-1+binzyg,data=twina,id="tvparnr",pair.ascertained=TRUE)
summary(ba1)
#+END_SRC  

#+RESULTS:
#+begin_example

              Estimate    Std.Err          Z p-value
(Intercept)   0.101193   0.031912   3.170993  0.0015
sexmale       0.049255   0.042886   1.148495  0.2508
r:binzygDZ   -3.952376   0.282620 -13.984759  0.0000
r:binzygMZ   -0.840831   0.169676  -4.955514  0.0000

logLik: -690.9136  mean(score^2): 5.008e-11 
    n pairs 
 1362   681 

Contrast:
	Dependence    [binzygDZ] 
	Mean          [(Intercept)] 

                        Estimate 2.5%     97.5%   
Rel.Recur.Risk           0.27611  0.13140  0.42081
OR                       0.00000      NaN      NaN
Tetrachoric correlation -0.99926 -0.99976 -0.99777
                                                  
Concordance              0.08060  0.04294  0.14627
Casewise Concordance     0.14918  0.08234  0.25520
Marginal                 0.54030  0.51540  0.56501
#+end_example


** Odd-Ratio modelling 

   First looking at the marginal model based on the full data we find the 
   overall level of stuttering and also that males have a much higher 
   stuttering risk.

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
margbin <- glm(binstut~factor(sex),data=twinstut,family=binomial())
summary(margbin)
#+END_SRC  

#+RESULTS:
#+begin_example

Call:
glm(formula = binstut ~ factor(sex), family = binomial(), data = twinstut)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-0.4127  -0.4127  -0.2716  -0.2716   2.5763  

Coefficients:
                Estimate Std. Error z value Pr(>|z|)    
(Intercept)     -3.28191    0.05000  -65.64   <2e-16 ***
factor(sex)male  0.86171    0.06211   13.87   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 9328.6  on 21287  degrees of freedom
Residual deviance: 9124.7  on 21286  degrees of freedom
AIC: 9128.7

Number of Fisher Scoring iterations: 6
#+end_example


First, fitting the OR model for MZ and DZ for the full data, we find 
that MZ have a much higher dependence than DZ twins. 


#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
theta.des <- model.matrix( ~-1+factor(zyg),data=twinstut)
bin <- binomial.twostage(margbin,data=twinstut,var.link=1,
                          clusters=twinstut$tvparnr,theta.des=theta.des)
summary(bin)
#+END_SRC  

#+RESULTS:
#+begin_example
Dependence parameter for Odds-Ratio (Plackett) model 
With log-link 
$estimates
                  theta        se
factor(zyg)dz 0.5238541 0.2400861
factor(zyg)mz 3.4930902 0.1865567

$or
              Estimate Std.Err   2.5% 97.5%  P-value
factor(zyg)dz     1.69   0.405  0.894  2.48 3.11e-05
factor(zyg)mz    32.89   6.135 20.862 44.91 8.31e-08

$type
[1] "plackett"

attr(,"class")
[1] "summary.mets.twostage"
#+end_example

Now, using the overall marginal we look at the adjusted likelihood and
find very similar results on the ascertained sample. Note, that the marginals 
are crucial for this analysis to give  useful results.


#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
theta.des <- model.matrix( ~-1+factor(zyg),data=twina)
bina <- binomial.twostage(margbin,data=twina,var.link=1,
             clusters=twina$tvparnr,theta.des=theta.des,
			 pair.ascertained=1)
summary(bina)
#+END_SRC  

#+RESULTS:
#+begin_example
Dependence parameter for Odds-Ratio (Plackett) model 
With log-link 
$estimates
                  theta        se
factor(zyg)dz 0.4874213 0.2472523
factor(zyg)mz 3.4753766 0.1985974

$or
              Estimate Std.Err   2.5% 97.5%  P-value
factor(zyg)dz     1.63   0.403  0.839  2.42 5.24e-05
factor(zyg)mz    32.31   6.417 19.734 44.89 4.77e-07

$type
[1] "plackett"

attr(,"class")
[1] "summary.mets.twostage"
#+end_example


