inst/doc/binomial-case-control-ascertainment.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Additive gamma modelling</h3>
<div class="outline-text-3" id="text-3-3">
<p>
First, again for comparision fitting the full data for the AE model. We get 
the size of the genetic variance in this model. 
</p>

<div class="org-src-container">

<pre class="src src-R">out <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> twin.polygen.design(twinstut,id=<span style="font-style: italic;">"tvparnr"</span>,zygname=<span style="font-style: italic;">"zyg"</span>,zyg=<span style="font-style: italic;">"dz"</span>,type=<span style="font-style: italic;">"ae"</span>)
bintwin <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(margbin,data=twinstut,
     clusters=twinstut$tvparnr,detail=0,theta=c(0.1)/1,var.link=0,
     random.design=out$des.rv,theta.des=out$pardes)
summary(bintwin)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.9094847 0.09536268

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1    0.909  0.0954 0.723   1.1 1.47e-21

attr(,"class")
[1] "summary.mets.twostage"
</pre>


<p>
We first here take at the look at the marginal model for the ascertained 
sample, and note as expected that this sample give highly biased estimated for 
the
 marginal model. 
</p>



<div class="org-src-container">

<pre class="src src-R">outa <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> twin.polygen.design(twina,id=<span style="font-style: italic;">"tvparnr"</span>,zygname=<span style="font-style: italic;">"zyg"</span>,zyg=<span style="font-style: italic;">"dz"</span>,type=<span style="font-style: italic;">"ae"</span>)
marga <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> glm(binstut~sex,data=twina,family=binomial())
summary(marga)
</pre>
</div>

<pre class="example">
Call:
glm(formula = binstut ~ sex, family = binomial(), data = twina)

Deviance Residuals: 
   Min      1Q  Median      3Q     Max  
-1.334  -1.298   1.028   1.028   1.061  

Coefficients:
            Estimate Std. Error z value Pr(&gt;|z|)   
(Intercept)  0.27895    0.08739   3.192  0.00141 **
sexmale      0.08242    0.11237   0.733  0.46328   
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 1851.8  on 1361  degrees of freedom
Residual deviance: 1851.2  on 1360  degrees of freedom
AIC: 1855.2

Number of Fisher Scoring iterations: 4
</pre>


<p>
Now, using the overall marginal model we look at the adjusted likelihood and
find very similar results on the ascertained sample. Note, that the marginals 
are crucial for this analysis to give  useful results.
</p>

<div class="org-src-container">

<pre class="src src-R">abintwin1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(margbin,data=twina,
               clusters=twina$tvparnr,detail=0,theta=c(0.1)/1,var.link=0,
               random.design=outa$des.rv,theta.des=outa$pardes,pair.ascertained=1)
summary(abintwin1)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.8920274 0.09732786

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1    0.892  0.0973 0.701  1.08 4.95e-20

attr(,"class")
[1] "summary.mets.twostage"
</pre>


<p>
In fact for this model we can also do a full-MLE fitting jointly the 
dependence paramters and the marginal model. This is based on the
twostage option (twostage=0 is MLE). Here the starting value is given at
the marginal model for the ascertained model. This gives quite similar
results to the previous analyses with a genetic variance around 1. 
</p>


<div class="org-src-container">

<pre class="src src-R">aabintwin1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(marga,data=twina,
                clusters=twina$tvparnr,detail=0,theta=c(0.1)/1,var.link=0,
                random.design=outa$des.rv,theta.des=outa$pardes,pair.ascertained=1,twostage=0)
summary(aabintwin1)
coef(marga)
coef(margbin)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
               theta        se
dependence1 1.014398 0.1045593

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1     1.01   0.105 0.809  1.22 2.97e-22

$marginal
             Coef.      SE Robust SE     z P-val lower2.5% upper97.5%
dependence2 -4.350 0.08560   0.08560 -50.8     0    -4.520     -4.180
dependence3  0.551 0.00606   0.00606  90.8     0     0.539      0.563

attr(,"class")
[1] "summary.mets.twostage"
(Intercept)     sexmale 
  0.2789484   0.0824214
    (Intercept) factor(sex)male 
     -3.2819072       0.8617053
</pre>
</div>
</div>
</div>
