inst/doc/binomial-case-control-ascertainment.org
* Case Control Sampling 

  First, taking out all cases and one control for each case, we establish the
  pairs of these probands. This is based on keeping track of the twin related 
  to the proband. Here using some utility functions in the mets packages. 

  Then we write up the random design vectors  and the parameter design for 
  each pair using the kinship coefficient. 

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 

twinstut  <-   dby(twinstut,binstut~tvparnr,stuttot=sum,nn=seq_along,n=length)
twinstut <-    subset(twinstut,n==2)
twinstut  <-   dtransform(twinstut,nnrow=1:nrow(twinstut))
twinstut  <-   dby(twinstut,binstut~tvparnr,nnn=seq_along)
twinstut  <-   dby2(twinstut,nnrow~tvparnr,pairnr=rev)

cases <- which(twinstut$binstut==1)
controls <- sample(which(twinstut$binstut==0),1217)
rowsca <- with(twinstut,nnrow[cases])
rowsco <- with(twinstut,nnrow[controls])
rpairs <- c(rowsca,rowsco)
cc.pairs <- cbind( with(twinstut,pairnr.nnrow[rpairs]),rpairs)

ids <- sort(unique(c(cc.pairs)))
###
pairsids <- c(cc.pairs)
pair.new <- matrix(fast.approx(ids,pairsids),ncol=2)
head(pair.new)

dataid <- dsort(twinstut[ids,],"tvparnr")
dataid=dtransform(dataid,kinship=0.5)
dataid=dtransform(dataid,kinship=1,binzyg=="MZ")
kinship <- dataid$kinship[pair.new[,2]]

out <- make.pairwise.design(pair.new,kinship,type="ae") 
names(out)
out$random.des[,,1]
out$theta.des[,,1]
#+END_SRC  

#+RESULTS:
#+begin_example
     [,1] [,2]
[1,]   18   17
[2,]   32   31
[3,]   34   33
[4,]   60   59
[5,]   62   61
[6,]   72   71
[1] "random.design" "theta.des"     "ant.rvs"
     [,1] [,2] [,3]
[1,]    1    1    0
[2,]    1    0    1
[1] 0.5 0.5 0.5
#+end_example


Now doing the analyses, first with know marginals, that is marginals from the 
full data. For this analysis, since marginals do not contain dependence 
parameters we do not need to specify that this is case-control sampling. 
Having a correct is crucial for this to work, but this is certainly often 
possible in register based studies where a full cohort is also available. 

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
cc  <- binomial.twostage(margbin,data=dataid,
			    clusters=dataid$tvparnr,
	         pairs=pair.new,
	         random.design=out$random.design,
             theta.des=out$theta.des,
	         pairs.rvs=out$ant.rvs,
             case.control=0,twostage=1)
summary(cc)
#+END_SRC  

#+RESULTS:
#+begin_example
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.8700651 0.09627946

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1     0.87  0.0963 0.681  1.06 1.61e-19

attr(,"class")
[1] "summary.mets.twostage"
#+end_example


We now do the same analysis specifying the case-control sampling. This 
should result in the same dependence parameters as is also the case.

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
cc3 <- binomial.twostage(margbin,data=dataid,
			    clusters=dataid$tvparnr,
                 pairs=pair.new,
                 random.design=out$random.design,
                 theta.des=out$theta.des,
                 pairs.rvs=out$ant.rvs,
                 case.control=1,twostage=1)
summary(cc3)
#+END_SRC  

#+RESULTS:
#+begin_example
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.8700651 0.09627946

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1     0.87  0.0963 0.681  1.06 1.61e-19

attr(,"class")
[1] "summary.mets.twostage"
#+end_example

This model can  also be fitted using a full likelhood of both dependence 
parameters and marginal parameters. Here there is no need to have a 
correctly specified marginal. We here use the marginal fitting from the
case-control data as as starting values.  Again we find a genetic variance 
around 1. The marginal parameters are also consistent with the results from 
the full analyses for the marginal parameters. 

#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
marga <- glm(binstut~sex,data=dataid,family=binomial())
cc3 <- binomial.twostage(marga,data=dataid,
             clusters=dataid$tvparnr,
             pairs=pair.new,
             random.design=out$random.design,
             theta.des=out$theta.des,
             pairs.rvs=out$ant.rvs,
             case.control=1,twostage=0)
summary(cc3)
#+END_SRC  

#+RESULTS:
#+begin_example
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta        se
dependence1 0.8908294 0.0957289

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1    0.891  0.0957 0.703  1.08 1.33e-20

$marginal
             Coef.      SE Robust SE    z P-val lower2.5% upper97.5%
dependence2 -3.420 0.00693   0.00693 -493     0    -3.430     -3.410
dependence3  0.715 0.00150   0.00150  476     0     0.712      0.718

attr(,"class")
[1] "summary.mets.twostage"
#+end_example


When probands are related, here we may choose both case and controls from
the same twin-pair then we need to adjust standard errors by grouping together
contribution from related probands. This can be done using the
se.cluster option that specifies how to cluster in the computation of the
standard errors. In this case, however, this will be same as the 
clusters since these also are identical across pairs.


