inst/doc/binomial-case-control-ascertainment.html


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Case Control Sampling</h2>
<div class="outline-text-2" id="text-4">
<p>
First, taking out all cases and one control for each case, we establish the
pairs of these probands. This is based on keeping track of the twin related 
to the proband. Here using some utility functions in the mets packages. 
</p>

<p>
Then we write up the random design vectors  and the parameter design for 
each pair using the kinship coefficient. 
</p>

<div class="org-src-container">

<pre class="src src-R">twinstut  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span>   dby(twinstut,binstut~tvparnr,stuttot=sum,nn=seq_along,n=length)
twinstut <span style="font-weight: bold; text-decoration: underline;">&lt;-</span>    subset(twinstut,n==2)
twinstut  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span>   dtransform(twinstut,nnrow=1:nrow(twinstut))
twinstut  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span>   dby(twinstut,binstut~tvparnr,nnn=seq_along)
twinstut  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span>   dby2(twinstut,nnrow~tvparnr,pairnr=rev)

cases <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> which(twinstut$binstut==1)
controls <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> sample(which(twinstut$binstut==0),1217)
rowsca <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> with(twinstut,nnrow[cases])
rowsco <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> with(twinstut,nnrow[controls])
rpairs <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(rowsca,rowsco)
cc.pairs <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> cbind( with(twinstut,pairnr.nnrow[rpairs]),rpairs)

ids <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> sort(unique(c(cc.pairs)))
<span style="font-weight: bold; font-style: italic;">###</span>
pairsids <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(cc.pairs)
pair.new <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> matrix(fast.approx(ids,pairsids),ncol=2)
head(pair.new)

dataid <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> dsort(twinstut[ids,],<span style="font-style: italic;">"tvparnr"</span>)
dataid=dtransform(dataid,kinship=0.5)
dataid=dtransform(dataid,kinship=1,binzyg==<span style="font-style: italic;">"MZ"</span>)
kinship <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> dataid$kinship[pair.new[,2]]

out <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> make.pairwise.design(pair.new,kinship,type=<span style="font-style: italic;">"ae"</span>) 
names(out)
out$random.des[,,1]
out$theta.des[,,1]
</pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]   10    9
[2,]   28   27
[3,]   32   31
[4,]   60   59
[5,]   66   65
[6,]   78   77
[1] "random.design" "theta.des"     "ant.rvs"
     [,1] [,2] [,3]
[1,]    1    1    0
[2,]    1    0    1
[1] 0.5 0.5 0.5
</pre>


<p>
Now doing the analyses, first with know marginals, that is marginals from the 
full data. For this analysis, since marginals do not contain dependence 
parameters we do not need to specify that this is case-control sampling. 
Having a correct is crucial for this to work, but this is certainly often 
possible in register based studies where a full cohort is also available. 
</p>

<div class="org-src-container">

<pre class="src src-R">cc  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(margbin,data=dataid,
                            clusters=dataid$tvparnr,
                 pairs=pair.new,
                 random.design=out$random.design,
             theta.des=out$theta.des,
                 pairs.rvs=out$ant.rvs,
             case.control=0,twostage=1)
summary(cc)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.8973263 0.09875075

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1    0.897  0.0988 0.704  1.09 1.02e-19

attr(,"class")
[1] "summary.mets.twostage"
</pre>


<p>
We now do the same analysis specifying the case-control sampling. This 
should result in the same dependence parameters as is also the case.
</p>

<div class="org-src-container">

<pre class="src src-R">cc3 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(margbin,data=dataid,
                            clusters=dataid$tvparnr,
                 pairs=pair.new,
                 random.design=out$random.design,
                 theta.des=out$theta.des,
                 pairs.rvs=out$ant.rvs,
                 case.control=1,twostage=1)
summary(cc3)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.8973263 0.09875075

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err  2.5% 97.5%  P-value
p1    0.897  0.0988 0.704  1.09 1.02e-19

attr(,"class")
[1] "summary.mets.twostage"
</pre>

<p>
This model can  also be fitted using a full likelhood of both dependence 
parameters and marginal parameters. Here there is no need to have a 
correctly specified marginal. We here use the marginal fitting from the
case-control data as as starting values.  Again we find a genetic variance 
around 1. The marginal parameters are also consistent with the results from 
the full analyses for the marginal parameters. 
</p>

<div class="org-src-container">

<pre class="src src-R">marga <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> glm(binstut~sex,data=dataid,family=binomial())
cc3 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.twostage(marga,data=dataid,
             clusters=dataid$tvparnr,
             pairs=pair.new,
             random.design=out$random.design,
             theta.des=out$theta.des,
             pairs.rvs=out$ant.rvs,
             case.control=1,twostage=0)
summary(cc3)
</pre>
</div>

<pre class="example">
Dependence parameter for Clayton-Oakes model
Variance of Gamma distributed random effects 
$estimates
                theta         se
dependence1 0.9320269 0.09819766

$type
[1] "clayton.oakes"

$h
            Estimate Std.Err 2.5% 97.5% P-value
dependence1        1       0    1     1       0

$vare
NULL

$vartot
   Estimate Std.Err 2.5% 97.5%  P-value
p1    0.932  0.0982 0.74  1.12 2.28e-21

$marginal
             Coef.      SE Robust SE       z P-val lower2.5% upper97.5%
dependence2 -3.590 0.00252   0.00252 -1420.0     0    -3.590     -3.590
dependence3  0.695 0.01340   0.01340    51.9     0     0.669      0.721

attr(,"class")
[1] "summary.mets.twostage"
</pre>


<p>
When probands are related, here we may choose both case and controls from
the same twin-pair then we need to adjust standard errors by grouping together
contribution from related probands. This can be done using the
se.cluster option that specifies how to cluster in the computation of the
standard errors. In this case, however, this will be same as the 
clusters since these also are identical across pairs.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Klaus Holst &amp; Thomas Scheike</p>
<p class="date">Created: 2017-02-27 Mon 15:51</p>
<p class="validation"></p>
</div>
</body>
</html>
